# Basic information about dataset

In [4]:
import seaborn as sns
data = sns.load_dataset('titanic')
data.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [16]:
print("Database dimentions:\n{} columns\n{} rows\n".format(data.shape[1], data.shape[0]))

Database dimentions:
14 columns
891 rows

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [57]:
data.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
embark_town      2
alive            0
alone            0
dtype: int64

In [24]:
data.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [25]:
data.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

### Looking for slices

In [28]:
data.iloc[10:13, #Range of index 
          2:4]   #Range of columns (viewed as an ordered list)

       sex   age
10  female   4.0
11  female  58.0
12    male  20.0

In [32]:
data.loc[data['age']>=77]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0,S,First,man,True,Southampton,yes,True

In [45]:
data.loc[(34<data['age'])&(data['age']<35)|~(data['fare']>=0)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
843,0,3,male,34.5,0,0,6.4375,C,Third,man,True,Cherbourg,no,True

In [49]:
data.loc[(data['age']==60), 'embark_town']

366      Cherbourg
587      Cherbourg
684    Southampton
694    Southampton
Name: embark_town, dtype: object

### Sorting values

In [54]:
data.sort_values(by=['age','pclass'], ascending=[0,1]).head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,Southampton,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,Cherbourg,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

### Grouping

In [62]:
data.groupby(['class'])[['age', 'fare', 'sibsp']].agg(['mean', 'count'])

              age             fare           sibsp
             mean count       mean count      mean count
class
First   38.233441   186  84.154687   216  0.416667   216
Second  29.877630   173  20.662183   184  0.402174   184
Third   25.140620   355  13.675550   491  0.615071   491